module.exports = {
	domain:'http://suishisuid.com',
	corp:'',
	mp:'suishisuid',
	secret:'41aecb4e7c8e4546b89ac7a95e0bbc73',
	appid:'wx585f9aa0138e27ba',
 	appsecret:'41aecb4e7c8e4546b89ac7a95e0bbc73',
  guideTxt:[
      '商家服务协议及条款',
      '本服务条款是您与随时随递信息服务平台（包含随时随递网站、随时随递终端软件）的所有者-----“北京金色华溢科技有限责任公司”（北京金色华溢科技有限责任公司及其关联公司、随时随递信息服务平台在协议中统称为"随时随递"，通过随时随递信息服务平台为您提供服务）之间就随时随递提供的信息服务等相关事宜所订立的合约或合同。',
      '请您仔细阅读本条款，您选择"我已了解并接受《注册服务条款》"并了解后成为随时随递的正式会员，本服务条款即构成了对双方具有法律约束力的文件。',
      '第1条 定义 随时随递信息服务平台，为提供及维护信息发布的服务平台。其为平台注册用户（信息发布方和接收方）提供信息中介和管理服务，并设计、开发信息服务产品，形成参考价格。',
      '平台注册用户是指通过随时随递信息服务平台完成全部注册程序后，使用随时随递信息服务平台服务的用户。',
      '随时特派员，是指申请注册并经随时随递审核通过后，通过随时随递信息服务平台自主选择接受任务信息、完成任务事项，并在事项完成后获得信息发布方给付的相应报酬的平台注册用户。',
      '信息发布方，是指在随时随递信息服务平台上创建、发布任务事项信息的平台注册用户。',
      '信息接受方，是指在随时随递信息服务平台上勾选、接受已发布的任务事项信息的随时特派员。',
/*      '第2条 服务条款的确认和接受',
          '2.1您应当在使用随时随递信息服务平台的服务之前认真阅读全部条款内容。如您对条款有任何疑问的，应向随时随递咨询。但无论您事实上是否在使用随时随递信息服务平台的服务之前认真阅读了本条款内容，只要您使用随时随递信息服务平台的服务，则本条款即对您产生约束，届时您不应以未阅读本条款的内容或者未获得随时随递对您问询的解答等理由，主张本条款无效，或要求撤销本条款。',
          '2.2用户必须完全同意所有服务条款并完成注册程序，才能成为随时随递的注册用户。在您按照注册页面提示填写信息、阅读并同意本条款并完成全部注册程序后或以其他随时随递允许的方式实际使用随时随递信息服务平台的服务时，您即受本条款的约束。',
          '2.3用户须确认，在完成注册程序或以其他随时随递允许的方式实际使用随时随递信息服务平台的服务时，应当是具备相应民事行为能力的自然人、法人或其他组织。如果不具备前述主体资格（如用户在18周岁以下），只能在父母或监护人的监护参与下才能使用随时随递创建或接受任务事项，且用户及其监护人应承担因此而导致的一切后果；随时随递有权注销该用户的账户。',
          '2.4当您在线下提供或接受服务的同时，您也承认了您拥有相应的权利能力和行为能力。您对提供或接受的任务事项的真实性、合法性负责，并能够独立承担法律责任。',
          '2.5用户确认：本协议条款是处理双方权利义务的当然约定依据，除非违反国家强制性法律，否则始终有效。',
          '2.6随时随递保留在中华人民共和国法律允许的范围内独自决定拒绝服务、关闭用户账户或取消任务事项的权利。',
          '2.7本协议内容包括协议正文及所有随时随递已经发布的或将来可能发布的各类规则。所有规则为本协议不可分割的组成部分，与协议正文具有同等法律效力。除另行明确声明外，任何随时随递及其关联公司提供的服务（以下称为随时随递信息服务平台的服务）均受本协议约束。您承诺接受并遵守本协议的约定。如果您不同意本协议的约定，您应立即停止注册程序或停止使用随时随递信息服务平台的服务。',
      '2.8随时随递有权根据国家法律法规的更新、产品和服务规则的调整需要不时地制订、修改本协议或各类规则，并以网站公示的方式进行公示。如您继续使用随时随递信息服务平台的服务的，即表示您接受经修订的协议和规则。',
      '第3条 服务简介',
          '3.1用户在完全同意本协议条款及本信息服务平台规定的情况下，方才可以使用本信息服务平台的相关服务。',
          '3.2随时随递提供的服务为：搭建、提供及维护信息发布；为平台注册用户（信息发布方和接收方）提供信息中介和管理服务，并设计、开发信息服务产品，形成参考价格。具体包括：',
          'A、平台注册用户可以以信息发布方的身份通过随时随递信息服务平台上创建、发布任务事项信息，也申请注册成为随时特派员（详见随时特派员注册协议）后，作为信息接收方选择接受任务事项信息并完成任务事项。',
          'B、若作为信息接收方的随时特派员同意为创建、发布任务事项信息的用户提供服务，则随时特派员在随时随递信息服务平台上勾选接受该任务事项。',
          'C、接受任务事项的随时特派员在向发布、创建任务事项信息的平台用户提供实际服务之前，双方均有权单方放弃任务事项；但随时随递有权根据平台注册用户放弃任务事项的情况，降低该用户相应的网站信用评级。',
          '3.3 信息发布方必须自行准备如下设备和承担如下开支：',
          'A 上网设备，包括并不限于手机、电脑或者其他上网终端、调制解调器及其他必备的上网装置；',
      'B 上网开支，包括并不限于网络接入费、上网设备租用费、手机流量费等。',
      '第4条 用户信息',
          '4.1用户应自行诚信向随时随递信息服务平台提供注册资料，用户保证其提供的注册资料真实、准确、完整、合法有效。用户注册资料如有变动的，应及时更新其注册资料。如果用户提供的注册资料不合法、不真实、不准确、不详尽的，需承担因此引起的相应责任及后果，并且随时随递保留终止其使用随时随递各项服务的权利。',
          '4.2用户在通过随时随递信息服务平台进行在线发布任务事项信息等活动时，涉及用户真实姓名/名称、履行地址、联系电话等隐私信息的，随时随递将予以严格保密，除非得用户的授权或法律法规、本条款另有规（约）定外，随时随递不会向外界披露用户隐私信息。',
          '4.3用户注册成功后，将产生用户名和密码等账户信息，您可以根据随时随递信息服务平台的规定改变您的密码。用户应谨慎合理的保存、使用其用户名和密码并对通过您的账户和密码实施的所有行为、活动及事件负全责。用户若发现任何不当使用用户账号或存在安全漏洞等其他可能危及用户账户安全的情况，应当立即以有效方式通知随时随递，要求随时随递暂停相关服务，并向公安机关报案。您理解随时随递对您的请求采取行动需要合理时间，随时随递对在采取行动前已经产生的后果（包括但不限于您的任何损失）不承担任何责任。',
          '4.4随时随递或随时随递指定的区域管理公司对该区域内随时随递信息服务平台的运营进行监管。区管公司对在服务过程中了解到的其他用户的信息依照《中华人民共和国合同法》及相关协议的规定承担保密义务。随时特派员只有在勾选“接受”任务事项后才能够看到信息发布方的详细信息。',
          '4.5用户同意：随时随递拥有通过邮件、短信、电话等形式，向在本平台注册的会员、区管公司、随时特派员发送告知信息的权利。',
          '4.6用户不得将在本平台注册获得的账户借（租）给他人使用，否则用户应承担由此产生的全部责任，并与实际使用人承担连带责任。',
          '4.7用户同意：随时随递有权使用用户的注册信息、用户名、密码等信息，登陆进入用户的注册账户，进行证据保全，包括但不限于公证、见证等。',
          '4.8用户知悉并认可：随时随递可能会与第三方合作向用户提供相关的网络服务，在此情况下，如该第三方同意承担与随时随递同等的保护用户隐私的责任，则随时随递有权将用户的注册资料等提供给该第三方。另外，在不透露单个用户隐私资料的前提下，随时随递有权对整个用户数据库进行分析并对用户数据库进行商业上的利用。',
      '4.9您了解并同意，随时随递有权应政府部门（包括司法及行政部门）的要求，向其提供您在随时随递信息服务平台填写的注册信息和发布纪录等必要信息。',
      '第5条 责任范围与责任限制',
          '5.1用户个人明确同意对网络服务的使用承担风险。随时随递对此不作任何类型的担保，不论是明确的或隐含的。包括但不限于：不担保服务一定能满足用户的要求，也不担保服务不会受中断，对服务的及时性，安全性，出错发生都不作担保；对在随时随递上以及相关产品得到的任何服务或交易进程，不作担保；对平台服务所涉及的技术及信息的有效性、准确性、正确性、可靠性、稳定性、完整性和及时性不作出任何承诺和保证；不担保平台服务的适用性、没有错误或疏漏、持续性、准确性、可靠性或适用于某一特定用途。',
          '5.2用户理解并接受：随时随递信息服务平台作为信息发布、服务平台，无法控制每一任务事项所涉及的物品的质量、安全或合法性，任务事项内容的真实性或准确性，以及任务事项所涉各方履行任务事项的能力。您应自行谨慎判断确定相关信息的真实性、合法性和有效性，并自行承担因此产生的责任与损失。任何信息资料(下载或通过随时随递会员服务取得)，取决于用户自己并由其承担系统受损或资料丢失的所有风险和责任。',
          '5.3除非法律法规明确要求，或出现以下情况，否则，随时随递没有义务对所有用户的信息数据、服务信息、任务发布行为以及与任务事项有关的其它事项进行事先审查：',
      '（1）随时随递有合理的理由认为特定会员及具体任务事项可能存在重大违法或违约情形。',
      '（2）随时随递有合理的理由认为用户在随时随递信息服务平台的行为涉嫌违法或不当。',
          '5.4用户了解并同意，随时随递不对因下述情况而导致的任何损害赔偿承担责任，包括但不限于利润、商誉、使用、数据等方面的损失或其它无形损失的损害赔偿：',
      '（1）使用或未能使用随时随递信息服务平台的服务；',
      '（2）第三方未经批准地使用用户的账户或更改用户的数据；',
      '（3）通过随时随递信息服务平台的服务购买或获取任何商品、样品、数据、信息等行为或替代行为产生的费用及损失；',
      '（4）用户对随时随递信息服务平台的服务的误解；',
      '（5）任何非因随时随递的原因而引起的与随时随递信息服务平台的服务有关的其它损失。',
          '5.5如因不可抗力或其他随时随递无法控制的原因使随时随递系统崩溃或无法正常使用导致网上交易无法完成或丢失有关的信息、记录等，随时随递不承担责任。但是随时随递会尽可能合理地协助处理善后事宜，并努力使客户免受经济损失。',
          '5.6用户同意在发现随时随递信息服务平台任何内容不符合法律规定，或不符合本用户协议条款规定的，有义务及时通知随时随递。如果用户发现个人信息被盗用或者其他权利被侵害，请将此情况告知随时随递并同时提供如下信息和材料：',
      '（1）侵犯您权利的信息的网址，编号或其他可以找到该信息的细节；',
      '（2）您的联系方式，包括联系人姓名，地址，电话号码和电子邮件；',
      '（3）您的身份证复印件、营业执照等其他相关资料。',
      '经审查得到证实的，我们将及时删除相关信息。我们仅接受邮寄、电子邮件或传真方式的书面侵权通知。情况紧急的，您可以通过客服电话先行告知，我们会视情况采取相应措施。',
      '5.7用户应当严格遵守本协议及随时随递发布的其他协议条款、活动规则，因用户违反协议或规则的行为给第三方、或随时随递造成损失的，用户应当承担全部责任。',
      '第6条 对用户信息的存储和限制',
          '6.1随时随递不对用户所发布信息的删除或储存失败负责。随时随递有判定用户的行为是否符合随时随递服务条款的要求和精神的保留权利，如果用户违背了服务条款的规定，随时随递有中断对其提供网络服务的权利。',
          '6.2用户账户被注销后，随时随递没有义务为其保留或向其披露其账户中的任何信息，也没有义务向用户或第三方转发任何用户未曾阅读或发送过的信息。',
          '6.3用户同意，与随时随递的协议关系终止后，随时随递仍享有下列权利：',
      '（1）继续保存用户未及时删除的注册信息及使用随时随递信息服务平台的服务期间发布的所有信息至法律规定的记录保存期满。',
      '（2）用户在使用随时随递信息服务平台的服务期间存在违法行为或违反本协议和/或规则的行为的，随时随递仍可依据本协议向用户主张权利。',
      '第7条 网络服务内容的所有权',
          '7.1随时随递各项电子服务的所有权和运作权归随时随递。',
          '7.2随时随递网络服务内容包括：文字、软件、声音、图片、录像、图表、广告中的全部内容；电子邮件的全部内容；随时随递为用户提供的其他信息。所有这些内容受版权、商标、标签和其它财产所有权法律的保护。所以，用户只能在随时随递和广告商授权下才能使用这些内容，而不能擅自复制、再造这些内容、或创造与内容有关的派生产品。随时随递所有的文章版权归原文作者和随时随递共同所有，任何人需要转载本站的文章，必须征得原文作者或随时随递授权。',
      '7.3用户接受本协议条款，即表明该用户将其在随时随递网站发表的任何形式的信息的著作权，包括并不限于：复制权、发行权、出租权、展览权、表演权、放映权、广播权、信息网络传播权、摄制权、改编权、翻译权、汇编权以及应当由著作权人享有的其他可转让权利无偿独家转让给随时随递所有，同时表明该用户许可随时随递有权就任何主体侵权而单独提起诉讼，并获得全部赔偿。本协议效力及于用户在随时随递发布的任何受著作权法保护的作品内容，无论该内容形成于本协议签订前还是本协议签订后。同时，随时随递保留删除站内各类不符合规定的信息而不通知用户的权利。',
      '第8条 平台服务使用规范',
          '8.1用户无论是作为信息方发布方或接收方，须按照随时随递提供、发布的服务条款和操作规则严格执行。',
          '8.2在使用随时随递服务过程中，用户承诺遵守以下约定：',
      '（1）在使用随时随递信息服务平台的服务过程中实施的所有行为均遵守国家法律、法规等规范文件及随时随递信息服务平台的各项规则的规定和要求，不违背社会公共利益或公共道德，不损害他人的合法权益，不违反本协议及相关规则。您如果违反前述承诺，产生任何法律后果的，您应以自己的名义独立承担所有的法律责任，并确保随时随递免于因此产生任何损失。',
      '（2）不发布国家禁止发布的任务事项信息（除非取得合法且足够的许可），不发布涉嫌侵犯他人知识产权或其它合法权益的信息，不发布违背社会公共利益或公共道德、公序良俗的信息，不发布其它涉嫌违法或违反本协议及各类规则的信息。',
      '（3）不对随时随递信息服务平台上的任何数据作商业性利用，包括但不限于在未经随时随递事先书面同意的情况下，以复制、传播等任何方式使用随时随递信息服务平台上展示的资料。',
      '（4）不使用任何装置、软件或例行程序干预或试图干预随时随递信息服务平台的正常运作或正在随时随递信息服务平台上进行的任何活动。您不得采取任何将导致不合理的庞大数据负载加诸随时随递信息服务平台网络设备的行动。',
      '（5）不得发表、传送、传播、储存侵害他人知识产权、商业秘密权等合法权利的内容或包含病毒、木马、定时炸弹等可能对随时随递系统造成伤害或影响其稳定性的内容。',
      '（6）不得进行危害计算机网络安全的行为，包括但不限于：使用未经许可的数据或进入未经许可的服务器帐号；不得未经允许进入公众计算机网络或者他人计算机系统并删除、修改、增加存储信息；不得未经许可，企图探查、扫描、测试本平台系统或网络的弱点或其它实施破坏网络安全的行为；不得企图干涉、破坏本平台系统或网站的正常运行。',
          '8.3用户了解并同意：',
      '（1）违反上述承诺时，随时随递有权依据本协议的约定，做出相应处理或终止向您提供服务，且无须征得您的同意或提前通知予您。',
      '（2）根据相关法令的指定或者随时随递服务规则的判断，用户的行为涉嫌违反法律法规的规定或违反本协议和/或规则的条款的，随时随递有权采取相应措施，包括但不限于直接屏蔽、删除侵权信息、降低信用值或直接停止提供服务。',
      '（3）对于用户在随时随递信息服务平台上实施的行为，包括未在随时随递信息服务平台上实施但已经对随时随递信息服务平台及其用户产生影响的行为，随时随递有权单方认定该行为的性质及是否构成对本协议和/或规则的违反，并据此采取相应的必要的处理措施。',
      '（4）对于用户涉嫌违反承诺的行为对任意第三方造成损害的，用户均应当以自己的名义独立承担所有的法律责任，并应确保随时随递免于承担因此产生的损失或增加的费用。',
      '（5）如用户涉嫌违反有关法律或者本协议之规定，使随时随递遭受任何损失，或受到任何第三方的索赔，或受到任何行政管理部门的处罚，用户应当赔偿随时随递因此造成的损失及发生的费用，包括合理的律师费用。',*/
      '第9条 法律管辖和适用',
      '本条款的订立、执行和解释及争议的解决均应适用中国法律。',
      '如双方就本条款内容或其执行发生任何争议，双方应尽力友好协商解决；协商不成时，任何一方均可向随时随递总部所在地的人民法院提起诉讼。'].join("\n")
};
var buttons = {
    button:[
        {
            "name":"随时随递",
            "sub_button":[
                {
                   "type":"view",
                   "name":"随时递",
                   "url":"https://open.weixin.qq.com/connect/oauth2/authorize?appid=wx585f9aa0138e27ba&redirect_uri=http://suishisuid.com/public/html/index.html&response_type=code&scope=snsapi_base&state=1#wechat_redirect",
                },
                {
                   "type":"view",
                   "name":"私人定制",
                   "url":"https://open.weixin.qq.com/connect/oauth2/authorize?appid=wx585f9aa0138e27ba&redirect_uri=http://suishisuid.com/public/html/personal_index.html&response_type=code&scope=snsapi_base&state=1#wechat_redirect",
                },
                {
                   "type":"click",
                   "name":"服务协议",
                   "key" :"guide"
                }

            ]
        },
        {
            "name":"活动",
            "sub_button":[
                {
                   "type":"view",
                   "name":"朋友帮朋友",
                   "url":"https://open.weixin.qq.com/connect/oauth2/authorize?appid=wx585f9aa0138e27ba&redirect_uri=http://suishisuid.com/public/html/find_friend.html&response_type=code&scope=snsapi_base&state=1#wechat_redirect",
                },
            ]
        },
        {
            "name":"更多服务",
            "sub_button":[
                {
                   "type":"view",
                   "name":"加入我们",
                   "url":"https://open.weixin.qq.com/connect/oauth2/authorize?appid=wx585f9aa0138e27ba&redirect_uri=http://suishisuid.com/public/html/join_us.html&response_type=code&scope=snsapi_base&state=1#wechat_redirect",
                },
                {
                   "type":"view",
                   "name":"我的订单",
                   "url":"https://open.weixin.qq.com/connect/oauth2/authorize?appid=wx585f9aa0138e27ba&redirect_uri=http://suishisuid.com/public/html/order_list.html&response_type=code&scope=snsapi_base&state=1#wechat_redirect",
                },
                {
                   "type":"view",
                   "name":"发票",
                   "url":"https://open.weixin.qq.com/connect/oauth2/authorize?appid=wx585f9aa0138e27ba&redirect_uri=http://suishisuid.com/public/html/invoice_total.html&response_type=code&scope=snsapi_base&state=1#wechat_redirect",
                },
                {
                   "type":"view",
                   "name":"联系我们",
                   "url":"https://open.weixin.qq.com/connect/oauth2/authorize?appid=wx585f9aa0138e27ba&redirect_uri=http://suishisuid.com/public/html/follow.html&response_type=code&scope=snsapi_base&state=1#wechat_redirect",
                }
            ]
        }

    ]
}
